export const sticker = {
  image: 'Перетащите фото или выберите файл',
  imageFormat: '',
  shape: 'Форма',
  amount: 'Количество стикеров',
  size: 'Размер',
  optimal: 'Оптимальный размер',
  customsize: 'Свой размер',
  background: 'Цвет фона',
  material: 'Материал',
};

export const add = {
  title: 'Заказать стикеры',
  tooltipOptimal:
    'Оптимальный размер - это размер, который соответствует количеству точек в картинке. При данном разрешении изображение выглядит наиболее качественно. Если на экране 300 точек видно как 3 см, то на бумаге это может быть 1 см, т.к. качество печати на бумаге может быть выше, чем на экране ПК.',
  addSicker: 'Добавить стикер',
  pages: 'Количество листов',
  preview: 'Предпросмотр страниц',
  price: 'Стоимость',
  options: { crop: 'Вырезать стикеры по контуру', page: 'Оставить стикеры на листе' },
  button: { add: 'Добавить в корзину', cart: 'Перейти в корзину' },
};

export const cart = {
  title: 'Корзина',
  pages: 'Количество листов',
  stickers: 'Количество стикеров',
  delivery: 'Способ доставки',
  address: 'Адрес',
  link: 'Редактировать заказ',
  button: 'Оформить заказ',
};
