import { generateRandomNumber } from '../../utils/generateRandomNumber';

// Мок политики конфиденциальности

export const privacy = {
  title: 'Политика в отношении обработки персональных данных',
  sections: [
    {
      id: generateRandomNumber(),
      title: '1. Общие положения',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: 'Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. № 152-ФЗ «О персональных данных» (далее — Закон о персональных данных) и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые Бусыгиной Анастасией (далее — Оператор).',
        },
        {
          id: generateRandomNumber(),
          text: '1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.',
        },
        {
          id: generateRandomNumber(),
          text: '1.2. Настоящая политика Оператора в отношении обработки персональных данных (далее — Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта https://StickerStack.ru.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '2. Основные понятия, используемые в Политике',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '2.1. Автоматизированная обработка персональных данных — обработка персональных данных с помощью средств вычислительной техники.',
        },
        {
          id: generateRandomNumber(),
          text: '2.2. Блокирование персональных данных — временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных).',
        },
        {
          id: generateRandomNumber(),
          text: '2.3. Веб-сайт — совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу https://StickerStack.ru.',
        },
        {
          id: generateRandomNumber(),
          text: '2.4. Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных и обеспечивающих их обработку информационных технологий и технических средств.',
        },
        {
          id: generateRandomNumber(),
          text: '2.5. Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных.',
        },
        {
          id: generateRandomNumber(),
          text: '2.6. Обработка персональных данных — любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.',
        },
        {
          id: generateRandomNumber(),
          text: '2.7. Оператор — государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и/или осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.',
        },
        {
          id: generateRandomNumber(),
          text: '2.8. Персональные данные — любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта https://StickerStack.ru.',
        },
        {
          id: generateRandomNumber(),
          text: '2.9. Персональные данные, разрешенные субъектом персональных данных для распространения, — персональные данные, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных путем дачи согласия на обработку персональных данных, разрешенных субъектом персональных данных для распространения в порядке, предусмотренном Законом о персональных данных (далее — персональные данные, разрешенные для распространения).',
        },
        {
          id: generateRandomNumber(),
          text: '2.10. Пользователь — любой посетитель веб-сайта https://StickerStack.ru.',
        },
        {
          id: generateRandomNumber(),
          text: '2.11. Предоставление персональных данных — действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц.',
        },
        {
          id: generateRandomNumber(),
          text: '2.12. Распространение персональных данных — любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом.',
        },
        {
          id: generateRandomNumber(),
          text: '2.13. Трансграничная передача персональных данных — передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу.',
        },
        {
          id: generateRandomNumber(),
          text: '2.14. Уничтожение персональных данных — любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и/или уничтожаются материальные носители персональных данных.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '3. Основные права и обязанности Оператора',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '3.1. Оператор имеет право:',
        },
        {
          id: generateRandomNumber(),
          text: '— получать от субъекта персональных данных достоверные информацию и/или документы, содержащие персональные данные;',
        },
        {
          id: generateRandomNumber(),
          text: '— в случае отзыва субъектом персональных данных согласия на обработку персональных данных, а также, направления обращения с требованием о прекращении обработки персональных данных, Оператор вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований, указанных в Законе о персональных данных;',
        },
        {
          id: generateRandomNumber(),
          text: '— самостоятельно определять состав и перечень мер, необходимых и достаточных для обеспечения выполнения обязанностей, предусмотренных Законом о персональных данных и принятыми в соответствии с ним нормативными правовыми актами, если иное не предусмотрено Законом о персональных данных или другими федеральными законами.',
        },
        {
          id: generateRandomNumber(),
          text: '3.2. Оператор обязан:',
        },
        {
          id: generateRandomNumber(),
          text: '— предоставлять субъекту персональных данных по его просьбе информацию, касающуюся обработки его персональных данных;',
        },
        {
          id: generateRandomNumber(),
          text: '— организовывать обработку персональных данных в порядке, установленном действующим законодательством РФ;',
        },
        {
          id: generateRandomNumber(),
          text: '— отвечать на обращения и запросы субъектов персональных данных и их законных представителей в соответствии с требованиями Закона о персональных данных;',
        },
        {
          id: generateRandomNumber(),
          text: '— сообщать в уполномоченный орган по защите прав субъектов персональных данных по запросу этого органа необходимую информацию в течение 30 дней с даты получения такого запроса;',
        },
        {
          id: generateRandomNumber(),
          text: '— публиковать или иным образом обеспечивать неограниченный доступ к настоящей Политике в отношении обработки персональных данных;',
        },
        {
          id: generateRandomNumber(),
          text: '— принимать правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении персональных данных;',
        },
        {
          id: generateRandomNumber(),
          text: '— прекратить передачу (распространение, предоставление, доступ) персональных данных, прекратить обработку и уничтожить персональные данные в порядке и случаях, предусмотренных Законом о персональных данных;',
        },
        {
          id: generateRandomNumber(),
          text: '— исполнять иные обязанности, предусмотренные Законом о персональных данных.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '4. Основные права и обязанности субъектов персональных данных',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '4.1. Субъекты персональных данных имеют право:',
        },
        {
          id: generateRandomNumber(),
          text: '— получать информацию, касающуюся обработки его персональных данных, за исключением случаев, предусмотренных федеральными законами. Сведения предоставляются субъекту персональных данных Оператором в доступной форме, и в них не должны содержаться персональные данные, относящиеся к другим субъектам персональных данных, за исключением случаев, когда имеются законные основания для раскрытия таких персональных данных. Перечень информации и порядок ее получения установлен Законом о персональных данных;',
        },
        {
          id: generateRandomNumber(),
          text: '— требовать от оператора уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав;',
        },
        {
          id: generateRandomNumber(),
          text: '— выдвигать условие предварительного согласия при обработке персональных данных в целях продвижения на рынке товаров, работ и услуг;',
        },
        {
          id: generateRandomNumber(),
          text: '— на отзыв согласия на обработку персональных данных, а также, на направление требования о прекращении обработки персональных данных;',
        },
        {
          id: generateRandomNumber(),
          text: '— обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке неправомерные действия или бездействие Оператора при обработке его персональных данных;',
        },
        {
          id: generateRandomNumber(),
          text: '— на осуществление иных прав, предусмотренных законодательством РФ.',
        },
        {
          id: generateRandomNumber(),
          text: '4.2. Субъекты персональных данных обязаны:',
        },
        {
          id: generateRandomNumber(),
          text: '— предоставлять Оператору достоверные данные о себе;',
        },
        {
          id: generateRandomNumber(),
          text: '— сообщать Оператору об уточнении (обновлении, изменении) своих персональных данных.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3. Лица, передавшие Оператору недостоверные сведения о себе, либо сведения о другом субъекте персональных данных без согласия последнего, несут ответственность в соответствии с законодательством РФ.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '5. Принципы обработки персональных данных',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '5.1. Обработка персональных данных осуществляется на законной и справедливой основе.',
        },
        {
          id: generateRandomNumber(),
          text: '5.2. Обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных целей. Не допускается обработка персональных данных, несовместимая с целями сбора персональных данных.',
        },
        {
          id: generateRandomNumber(),
          text: '5.3. Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместимых между собой.',
        },
        {
          id: generateRandomNumber(),
          text: '5.4. Обработке подлежат только персональные данные, которые отвечают целям их обработки.',
        },
        {
          id: generateRandomNumber(),
          text: '5.5. Содержание и объем обрабатываемых персональных данных соответствуют заявленным целям обработки. Не допускается избыточность обрабатываемых персональных данных по отношению к заявленным целям их обработки.',
        },
        {
          id: generateRandomNumber(),
          text: '5.6. При обработке персональных данных обеспечивается точность персональных данных, их достаточность, а в необходимых случаях и актуальность по отношению к целям обработки персональных данных. Оператор принимает необходимые меры и/или обеспечивает их принятие по удалению или уточнению неполных или неточных данных.',
        },
        {
          id: generateRandomNumber(),
          text: '5.7. Хранение персональных данных осуществляется в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не установлен федеральным законом, договором, стороной которого, выгодоприобретателем или поручителем по которому является субъект персональных данных. Обрабатываемые персональные данные уничтожаются либо обезличиваются по достижении целей обработки или в случае утраты необходимости в достижении этих целей, если иное не предусмотрено федеральным законом.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '6. Цели обработки персональных данных',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: 'Цель обработки -	информирование Пользователя посредством отправки электронных писем',
        },
        {
          id: generateRandomNumber(),
          text: 'Персональные данные	•	фамилия, имя, отчество •	электронный адрес •	номера телефонов',
        },
        {
          id: generateRandomNumber(),
          text: 'Правовые основания	•	ФЗ от 27.07.2006 №152-ФЗ «О персональных данных»',
        },
        {
          id: generateRandomNumber(),
          text: 'Виды обработки персональных данных	•	Сбор, запись, систематизация, накопление, хранение, уничтожение и обезличивание персональных данных •	Отправка информационных писем на адрес электронной почты',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '7. Условия обработки персональных данных',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '7.1. Обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его персональных данных.',
        },
        {
          id: generateRandomNumber(),
          text: '7.2. Обработка персональных данных необходима для достижения целей, предусмотренных международным договором Российской Федерации или законом, для осуществления возложенных законодательством Российской Федерации на оператора функций, полномочий и обязанностей.',
        },
        {
          id: generateRandomNumber(),
          text: '7.3. Обработка персональных данных необходима для осуществления правосудия, исполнения судебного акта, акта другого органа или должностного лица, подлежащих исполнению в соответствии с законодательством Российской Федерации об исполнительном производстве.',
        },
        {
          id: generateRandomNumber(),
          text: '7.4. Обработка персональных данных необходима для исполнения договора, стороной которого либо выгодоприобретателем или поручителем по которому является субъект персональных данных, а также для заключения договора по инициативе субъекта персональных данных или договора, по которому субъект персональных данных будет являться выгодоприобретателем или поручителем.',
        },
        {
          id: generateRandomNumber(),
          text: '7.5. Обработка персональных данных необходима для осуществления прав и законных интересов оператора или третьих лиц либо для достижения общественно значимых целей при условии, что при этом не нарушаются права и свободы субъекта персональных данных.',
        },
        {
          id: generateRandomNumber(),
          text: '7.6. Осуществляется обработка персональных данных, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных либо по его просьбе (далее — общедоступные персональные данные).',
        },
        {
          id: generateRandomNumber(),
          text: '7.7. Осуществляется обработка персональных данных, подлежащих опубликованию или обязательному раскрытию в соответствии с федеральным законом.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '8. Порядок сбора, хранения, передачи и других видов обработки персональных данных',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: 'Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.',
        },
        {
          id: generateRandomNumber(),
          text: '8.1. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц.',
        },
        {
          id: generateRandomNumber(),
          text: '8.2. Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства либо в случае, если субъектом персональных данных дано согласие Оператору на передачу данных третьему лицу для исполнения обязательств по гражданско-правовому договору.',
        },
        {
          id: generateRandomNumber(),
          text: '8.3. В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора StickerStack@gmail.com с пометкой «Актуализация персональных данных».',
        },
        {
          id: generateRandomNumber(),
          text: '8.4. Срок обработки персональных данных определяется достижением целей, для которых были собраны персональные данные, если иной срок не предусмотрен договором или действующим законодательством. Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством электронной почты на электронный адрес Оператора StickerStack@gmail.com с пометкой «Отзыв согласия на обработку персональных данных».',
        },
        {
          id: generateRandomNumber(),
          text: '8.5. Вся информация, которая собирается сторонними сервисами, в том числе платежными системами, средствами связи и другими поставщиками услуг, хранится и обрабатывается указанными лицами (Операторами) в соответствии с их Пользовательским соглашением и Политикой конфиденциальности. Субъект персональных данных и/или с указанными документами. Оператор не несет ответственность за действия третьих лиц, в том числе указанных в настоящем пункте поставщиков услуг.',
        },
        {
          id: generateRandomNumber(),
          text: '8.6. Установленные субъектом персональных данных запреты на передачу (кроме предоставления доступа), а также на обработку или условия обработки (кроме получения доступа) персональных данных, разрешенных для распространения, не действуют в случаях обработки персональных данных в государственных, общественных и иных публичных интересах, определенных законодательством РФ.',
        },
        {
          id: generateRandomNumber(),
          text: '8.7. Оператор при обработке персональных данных обеспечивает конфиденциальность персональных данных.',
        },
        {
          id: generateRandomNumber(),
          text: '8.8. Оператор осуществляет хранение персональных данных в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не установлен федеральным законом, договором, стороной которого, выгодоприобретателем или поручителем по которому является субъект персональных данных.',
        },
        {
          id: generateRandomNumber(),
          text: '8.9. Условием прекращения обработки персональных данных может являться достижение целей обработки персональных данных, истечение срока действия согласия субъекта персональных данных, отзыв согласия субъектом персональных данных или требование о прекращении обработки персональных данных, а также выявление неправомерной обработки персональных данных.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '9. Перечень действий, производимых Оператором с полученными персональными данными',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '9.1. Оператор осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление и уничтожение персональных данных.',
        },
        {
          id: generateRandomNumber(),
          text: '9.2. Оператор осуществляет автоматизированную обработку персональных данных с получением и/или передачей полученной информации по информационно-телекоммуникационным сетям или без таковой.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '10. Трансграничная передача персональных данных',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '10.1. Оператор до начала осуществления деятельности по трансграничной передаче персональных данных обязан уведомить уполномоченный орган по защите прав субъектов персональных данных о своем намерении осуществлять трансграничную передачу персональных данных (такое уведомление направляется отдельно от уведомления о намерении осуществлять обработку персональных данных).',
        },
        {
          id: generateRandomNumber(),
          text: '10.2. Оператор до подачи вышеуказанного уведомления, обязан получить от органов власти иностранного государства, иностранных физических лиц, иностранных юридических лиц, которым планируется трансграничная передача персональных данных, соответствующие сведения.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '11. Конфиденциальность персональных данных',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: 'Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать третьим лицам и не распространять персональные данные без согласия субъекта персональных данных, если иное не предусмотрено федеральным законом.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '12. Заключительные положения',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '12.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты StickerStack@gmail.com.',
        },
        {
          id: generateRandomNumber(),
          text: '12.2. В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией.',
        },
        {
          id: generateRandomNumber(),
          text: '12.3. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу https://StickerStack.ru/privacy/.',
        },
      ],
    },
  ],
};

export const terms = {
  title: 'Условия использования сервиса',
  sections: [
    {
      id: generateRandomNumber(),
      title: '1. Общие положения',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '1.1. Настоящее Пользовательское соглашение (далее - Соглашение) относится к сайту «НАЗВАНИЕ САЙТА», расположенному по адресу АДРЕС САЙТА.',
        },
        {
          id: generateRandomNumber(),
          text: '1.2. Сайт «НАЗВАНИЕ САЙТА» (далее - Сайт) является собственностью юридического лица ОРГАНИЗАЦИЯ (ОГРН: НОМЕР, ИНН: НОМЕР, адрес регистрации: ЮР.АДРЕС)',
        },
        {
          id: generateRandomNumber(),
          text: '1.3. Настоящее Соглашение регулирует отношения между Администрацией сайта «НАЗВАНИЕ САЙТА» (далее - Администрация сайта) и Пользователем данного Сайта.',
        },
        {
          id: generateRandomNumber(),
          text: '1.4. Администрация сайта оставляет за собой право в любое время изменять, добавлять или удалять пункты настоящего Соглашения без уведомления Пользователя.',
        },
        {
          id: generateRandomNumber(),
          text: '1.5. Использование Сайта Пользователем означает принятие Соглашения и изменений, внесенных в настоящее Соглашение.',
        },
        {
          id: generateRandomNumber(),
          text: '1.6. Пользователь несет персональную ответственность за проверку настоящего Соглашения на наличие изменений в нем.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '2. Определения терминов',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '2.1. Перечисленные ниже термины имеют для целей настоящего Соглашения следующее значение:',
        },
        {
          id: generateRandomNumber(),
          text: '2.1.1 «НАЗВАНИЕ САЙТА» - Интернет-ресурс, расположенный на доменном имени АДРЕС САЙТА, осуществляющий свою деятельность посредством Интернет-ресурса и сопутствующих ему сервисов (далее - Сайт).',
        },
        {
          id: generateRandomNumber(),
          text: '2.1.2. «НАЗВАНИЕ САЙТА» - сайт, содержащий информацию о Товарах и/или Услугах и/или Иных ценностях для пользователя, Продавце и/или Исполнителе услуг, позволяющий осуществить выбор, заказ и (или) приобретение Товара, и/или получение услуги.',
        },
        {
          id: generateRandomNumber(),
          text: '2.1.3. Администрация сайта - уполномоченные сотрудники на управления Сайтом, действующие от имени юридического лица ОРГАНИЗАЦИЯ.',
        },
        {
          id: generateRandomNumber(),
          text: '2.1.4. Пользователь сайта (далее - Пользователь) - лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт.',
        },
        {
          id: generateRandomNumber(),
          text: '2.1.5. Содержание сайта (далее - Содержание) - охраняемые результаты интеллектуальной деятельности, включая тексты литературных произведений, их названия, предисловия, аннотации, статьи, иллюстрации, обложки, музыкальные произведения с текстом или без текста, графические, текстовые, фотографические, производные, составные и иные произведения, пользовательские интерфейсы, визуальные интерфейсы, названия товарных знаков, логотипы, программы для ЭВМ, базы данных, а также дизайн, структура, выбор, координация, внешний вид, общий стиль и расположение данного Содержания, входящего в состав Сайта и другие объекты интеллектуальной собственности все вместе и/или по отдельности, содержащиеся на сайте АДРЕС САЙТА.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '3. Предмет соглашения',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '3.1. Предметом настоящего Соглашения является предоставление Пользователю доступа к содержащимся на Сайте Товарам и/или оказываемым услугам.',
        },
        {
          id: generateRandomNumber(),
          text: '3.1.1. Сайт предоставляет Пользователю следующие виды услуг (сервисов): • предоставление Пользователю возможности размещения сообщений, комментариев, рецензий Пользователей, выставления оценок контенту сайта; • ознакомление с товарами/услугами, размещенными на Сайте; • выбор и заказ товаров/услуг для осуществления последующей покупки или оформления на данном Сайте.',
        },
        {
          id: generateRandomNumber(),
          text: '3.1.2. Под действие настоящего Соглашения подпадают все существующие (реально функционирующие) на данный момент услуги (сервисы) Сайта, а также любые их последующие модификации и появляющиеся в дальнейшем дополнительные услуги (сервисы). 3.2. Доступ к сайту предоставляется на бесплатной основе.',
        },
        {
          id: generateRandomNumber(),
          text: '3.3. Настоящее Соглашение является публичной офертой. Получая доступ к Сайту Пользователь считается присоединившимся к настоящему Соглашению.',
        },
        {
          id: generateRandomNumber(),
          text: '3.4. Использование материалов и сервисов Сайта регулируется нормами действующего законодательства Российской Федерации',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '4. Права и обязанности сторон',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '4.1. Администрация сайта вправе:',
        },
        {
          id: generateRandomNumber(),
          text: '4.1.1. Изменять правила пользования Сайтом, а также изменять содержание данного Сайта. Изменения вступают в силу с момента публикации новой редакции Соглашения на Сайте.',
        },
        {
          id: generateRandomNumber(),
          text: '4.2. Пользователь вправе:',
        },
        {
          id: generateRandomNumber(),
          text: '4.2.1. Пользоваться всеми имеющимися на Сайте услугами, а также приобретать любые Товары и/или Услуги, предлагаемые на Сайте.',
        },
        {
          id: generateRandomNumber(),
          text: '4.2.2. Задавать любые вопросы, относящиеся к услугам сайта:',
        },
        {
          id: generateRandomNumber(),
          text: '• по телефону: ТЕЛЕФОН',
        },
        {
          id: generateRandomNumber(),
          text: '• по электронной почте: ПОЧТА',
        },
        {
          id: generateRandomNumber(),
          text: '• через Форму обратной связи, расположенную по адресу: АДРЕС САЙТА',
        },
        {
          id: generateRandomNumber(),
          text: '4.2.3. Пользоваться Сайтом исключительно в целях и порядке, предусмотренных Соглашением и не запрещенных законодательством Российской Федерации.',
        },
        {
          id: generateRandomNumber(),
          text: '4.2.5. Требовать от администрации скрытия любой информации о пользователе.',
        },
        {
          id: generateRandomNumber(),
          text: '4.2.6. Использовать информацию сайта в коммерческих целях без специального разрешения.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3. Пользователь Сайта обязуется:',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.1. Предоставлять по запросу Администрации сайта дополнительную информацию, которая имеет непосредственное отношение к предоставляемым услугам данного Сайта.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.2. Соблюдать имущественные и неимущественные права авторов и иных правообладателей при использовании Сайта.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.3. Не предпринимать действий, которые могут рассматриваться как нарушающие нормальную работу Сайта.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.4. Не распространять с использованием Сайта любую конфиденциальную и охраняемую законодательством Российской Федерации информацию о физических либо юридических лицах.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.5. Избегать любых действий, в результате которых может быть нарушена конфиденциальность охраняемой законодательством Российской Федерации информации.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.5. Избегать любых действий, в результате которых может быть нарушена конфиденциальность охраняемой законодательством Российской Федерации информации.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.7. Не использовать сервисы с целью:',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.7.1. нарушения прав несовершеннолетних лиц и (или) причинение им вреда в любой форме.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.7.2. ущемления прав меньшинств.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.7.3. представления себя за другого человека или представителя организации и (или) сообщества без достаточных на то прав, в том числе за сотрудников данного сайта.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.7.4. введения в заблуждение относительно свойств и характеристик какого-либо Товара и/или услуги, размещенных на Сайте.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.7.5. некорректного сравнения Товара и/или Услуги, а также формирования негативного отношения к лицам, (не) пользующимся определенными Товарами и/или услугами, или осуждения таких лиц.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.7.6. загрузки контента, который является незаконным, нарушает любые права третьих лиц; пропагандирует насилие, жестокость, ненависть и (или) дискриминацию по расовому, национальному, половому, религиозному, социальному признакам; содержит недостоверные сведения и (или) оскорбления в адрес конкретных лиц, организаций, органов власти.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.7.7. побуждения к совершению противоправных действий, а также содействия лицам, действия которых направлены на нарушение ограничений и запретов, действующих на территории Российской Федерации.',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.8. Обеспечить достоверность предоставляемой информации',
        },
        {
          id: generateRandomNumber(),
          text: '4.3.9. Обеспечивать сохранность личных данных от доступа третьих лиц.',
        },
        {
          id: generateRandomNumber(),
          text: '4.4. Пользователю запрещается:',
        },
        {
          id: generateRandomNumber(),
          text: '4.4.1. Использовать любые устройства, программы, процедуры, алгоритмы и методы, автоматические устройства или эквивалентные ручные процессы для доступа, приобретения, копирования или отслеживания содержания Сайта.',
        },
        {
          id: generateRandomNumber(),
          text: '4.4.2. Нарушать надлежащее функционирование Сайта.',
        },
        {
          id: generateRandomNumber(),
          text: '4.4.3. Любым способом обходить навигационную структуру Сайта для получения или попытки получения любой информации, документов или материалов любыми средствами, которые специально не представлены сервисами данного Сайта.',
        },
        {
          id: generateRandomNumber(),
          text: '4.4.4. Несанкционированный доступ к функциям Сайта, любым другим системам или сетям, относящимся к данному Сайту, а также к любым услугам, предлагаемым на Сайте.',
        },
        {
          id: generateRandomNumber(),
          text: '4.4.4. Нарушать систему безопасности или аутентификации на Сайте или в любой сети, относящейся к Сайту.',
        },
        {
          id: generateRandomNumber(),
          text: '4.4.5. Выполнять обратный поиск, отслеживать или пытаться отслеживать любую информацию о любом другом Пользователе Сайта.',
        },
        {
          id: generateRandomNumber(),
          text: '4.4.6. Использовать Сайт и его Содержание в любых целях, запрещенных законодательством Российской Федерации, а также подстрекать к любой незаконной деятельности или другой деятельности, нарушающей права Сайта или других лиц.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '5. Использование сайта',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '5.1. Сайт и Содержание, входящее в состав Сайта, принадлежит и управляется Администрацией сайта.',
        },
        {
          id: generateRandomNumber(),
          text: '5.2. Содержание Сайта защищено авторским правом, законодательством о товарных знаках, а также другими правами, связанными с интеллектуальной собственностью, и законодательством о недобросовестной конкуренции.',
        },
        {
          id: generateRandomNumber(),
          text: '5.3. Настоящее Соглашение распространяет свое действия на все дополнительные положения и условия о покупке Товара и/или оказанию услуг, предоставляемых на Сайте.',
        },
        {
          id: generateRandomNumber(),
          text: '5.4. Информация, размещаемая на Сайте не должна истолковываться как изменение настоящего Соглашения.',
        },
        {
          id: generateRandomNumber(),
          text: '5.5. Администрация сайта имеет право в любое время без уведомления Пользователя вносить изменения в перечень Товаров и услуг, предлагаемых на Сайте, и (или) их цен.',
        },
        {
          id: generateRandomNumber(),
          text: '5.6. Документ указанный в пункте 5.7. настоящего Соглашения регулирует в соответствующей части и распространяют свое действие на использование Пользователем Сайта.',
        },
        {
          id: generateRandomNumber(),
          text: '5.7. Политика конфиденциальности: ССЫЛКА НА ДОКУМЕНТ ',
        },
        {
          id: generateRandomNumber(),
          text: '5.8. Любой из документов, перечисленных в пункте 5.7 настоящего Соглашения может подлежать обновлению. Изменения вступают в силу с момента их опубликования на Сайте.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '6. Ответственность',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '6.1. Любые убытки, которые Пользователь может понести в случае умышленного или неосторожного нарушения любого положения настоящего Соглашения, а также вследствие несанкционированного доступа к коммуникациям другого Пользователя, Администрацией сайта не возмещаются.',
        },
        {
          id: generateRandomNumber(),
          text: '6.2. Администрация сайта не несет ответственности за:',
        },
        {
          id: generateRandomNumber(),
          text: '6.2.1. Задержки или сбои в процессе совершения операции, возникшие вследствие непреодолимой силы, а также любого случая неполадок в телекоммуникационных, компьютерных, электрических и иных смежных системах.',
        },
        {
          id: generateRandomNumber(),
          text: '6.2.2. Действия систем переводов, банков, платежных систем и за задержки связанные с их работой.',
        },
        {
          id: generateRandomNumber(),
          text: '6.2.3. Надлежащее функционирование Сайта, в случае, если Пользователь не имеет необходимых технических средств для его использования, а также не несет никаких обязательств по обеспечению пользователей такими средствами.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '7. Нарушение условий пользовательского соглашения',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '7.1. Администрация сайта имеет право раскрыть информацию о Пользователе, если действующее законодательство Российской Федерации требует или разрешает такое раскрытие.',
        },
        {
          id: generateRandomNumber(),
          text: '7.2. Администрация сайта вправе без предварительного уведомления Пользователя прекратить и (или) заблокировать доступ к Сайту, если Пользователь нарушил настоящее Соглашение или содержащиеся в иных документах условия пользования Сайтом, а также в случае прекращения действия Сайта либо по причине технической неполадки или проблемы.',
        },
        {
          id: generateRandomNumber(),
          text: '7.3. Администрация сайта не несет ответственности перед Пользователем или третьими лицами за прекращение доступа к Сайту в случае нарушения Пользователем любого положения настоящего Соглашения или иного документа, содержащего условия пользования Сайтом.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '8. Разрешение споров',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '8.1. В случае возникновения любых разногласий или споров между Сторонами настоящего Соглашения обязательным условием до обращения в суд является предъявление претензии (письменного предложения о добровольном урегулировании спора).',
        },
        {
          id: generateRandomNumber(),
          text: '8.2. Получатель претензии в течение 30 календарных дней со дня ее получения, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.',
        },
        {
          id: generateRandomNumber(),
          text: '8.3. При невозможности разрешить спор в добровольном порядке любая из Сторон вправе обратиться в суд за защитой своих прав, которые предоставлены им действующим законодательством Российской Федерации.',
        },
        {
          id: generateRandomNumber(),
          text: '8.4. Любой иск в отношении условий использования Сайта должен быть предъявлен в течение 5 дней после возникновения оснований для иска, за исключением защиты авторских прав на охраняемые в соответствии с законодательством материалы Сайта. При нарушении условий данного пункта любой иск оставляется судом без рассмотрения.',
        },
      ],
    },
    {
      id: generateRandomNumber(),
      title: '9. Дополнительные условия',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: '9.1. Администрация сайта не принимает встречные предложения от Пользователя относительно изменений настоящего Пользовательского соглашения.',
        },
        {
          id: generateRandomNumber(),
          text: '9.2. Отзывы Пользователя, размещенные на Сайте, не являются конфиденциальной информацией и могут быть использованы Администрацией сайта без ограничений.',
        },
      ],
    },
  ],
};

export const cookie = {
  title: 'Политика использования файлов cookie',
  sections: [
    {
      id: generateRandomNumber(),
      title: '',
      paragraphs: [
        {
          id: generateRandomNumber(),
          text: 'Наш сайт, как и большинство других, использует файлы cookie, чтобы предоставлять услуги, наиболее отвечающие Вашим интересам и потребностям, а также собирать статистическую и маркетинговую информацию для анализа и совершенствования наших услуг и сайтов. ',
        },
        {
          id: generateRandomNumber(),
          text: 'Cookies - это небольшие файлы, которые сохраняются на вашем компьютере при посещении сайта. Они позволяют сайту запоминать ваши предпочтения и настройки, а также собирать информацию о том, как вы используете сайт.',
        },
        {
          id: generateRandomNumber(),
          text: 'Мы используем cookies для следующих целей:',
        },
        {
          id: generateRandomNumber(),
          text: '1. Улучшение функциональности сайта: мы используем cookies, чтобы запомнить ваши предпочтения и настройки, например, язык сайта или размер шрифта.',
        },
        {
          id: generateRandomNumber(),
          text: '2. Анализ использования сайта: мы используем cookies, чтобы собирать информацию о том, как вы используете наш сайт. Это позволяет нам оптимизировать работу сайта и улучшить пользовательский опыт.',
        },
        {
          id: generateRandomNumber(),
          text: '3. Реклама: мы можем использовать cookies, чтобы показывать вам более релевантную рекламу на нашем сайте и на других сайтах.',
        },
        {
          id: generateRandomNumber(),
          text: 'Вы можете отключить использование cookies в настройках вашего браузера. Однако, это может привести к ограничению функциональности сайта и ухудшению пользовательского опыта.',
        },
        {
          id: generateRandomNumber(),
          text: 'Мы не передаем информацию, собранную через cookies, третьим лицам, кроме случаев, когда это необходимо для обеспечения работы сайта или соблюдения законодательства. ',
        },
        {
          id: generateRandomNumber(),
          text: 'Продолжая использовать наш сайт, вы соглашаетесь с использованием cookies в соответствии с нашей политикой конфиденциальности.',
        },
      ],
    },
  ],
};
