export const stickertext = {
  image: 'Перетащите фото или выберите файл',
  imageFormat: 'Допустимые форматы: .jpg, .jpeg, .png',
  shape: 'Форма',
  amount: 'Количество стикеров',
  size: 'Размер',
  optimal: 'Оптимальный размер',
  customsize: 'Свой размер',
  background: 'Цвет фона',
  material: 'Материал',
  errorImageSize: 'Максимально допустимый размер картинки - до 1Мб!',
};

export const addpage = {
  title: 'Заказать стикеры',
  tooltipOptimal:
    'Оптимальный размер\u00A0- это размер, который соответствует количеству точек в\u00A0картинке и\u00A0позволяет достичь наивысшего качества изображения. Если 400 пикселей вашей исходной картинки на\u00A0экране видно как 10\u00A0см, то\u00A0на\u00A0бумаге это может быть 3\u00A0см, т.к. плотность точек выше (мы\u00A0используем разрешение 300 точек на\u00A0дюйм). При сильном отклонении от\u00A0оптимального размера есть риск исказить изображение.',
  addSicker: 'Добавить стикер',
  pages: 'Количество листов',
  preview: 'Предпросмотр страниц',
  price: 'Стоимость',
  options: { crop: 'Вырезать стикеры по контуру', page: 'Оставить стикеры на листе' },
  button: { add: 'Добавить в корзину', cart: 'Перейти в корзину' },
  loading: 'Загружаем ваши стикеры',
  error: 'Не удалось прогрузить ваши добавленные стикеры. Попробуйте перезагрузить страницу',
};

export const cartpage = {
  title: 'Корзина',
  empty: 'Ваша корзина пуста',
  pages: 'Количество листов',
  stickers: 'Количество стикеров',
  cropping: 'Вырезать по контуру',
  delivery: 'Способ доставки',
  address: 'Адрес',
  link: 'Редактировать заказ',
  button: 'Оформить заказ',
  loading: 'Ваша корзина прогружается, минутку',
  error: 'Не удалось прогрузить товары в вашей корзине. Попробуйте перезагрузить страницу',
};
